[Original file](https://colab.research.google.com/drive/1Lk1YtZkTgRYwNvBaGCMdbgwEnOhBpaYe?usp=sharing) created at Praxis Business school

# Setup

## Initiation:

In [4]:
!pip install mysqlclient > /dev/null

import pandas as pd
import MySQLdb

## Credentials

In [5]:
hostName = 'remotemysql.com'   # place your own credentials here
userName = 'UDReedbczU'      # place your own credentials here
passWord = 'EzCB9vazqz'      # place your own credentials here
dbName =  'UDReedbczU'         # place your own credentials here

## Connecting to DB

In [6]:
DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)

# Access_methods

In [7]:
#To run any non-SELECT SQL command
def runCMD (DDL):
    DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    myCursor = DBConn.cursor()
    retcode = myCursor.execute(DDL) 
    print (retcode)
    DBConn.commit()
    DBConn.close()

In [8]:
#To run SELECT command
def runSELECT (CMD):
    DBConn= MySQLdb.connect(hostName,userName,passWord,dbName)
    df_mysql = pd.read_sql(CMD, con=DBConn)    
    DBConn.close()
    return df_mysql

In [33]:
def r(message):
    if message[0:6] == 'SELECT':
      return runSELECT(message)
    else:
      return runCMD(message)

# Data_instantiation

## Emp and Dept

In [16]:
r("DROP TABLE IF EXISTS Dept;")
r("CREATE TABLE Dept ( \
DeptID char(2)  NOT NULL, \
DeptName varchar(50) , \
ManagerID char(6) , \
Location varchar(50) \
);")

r("INSERT INTO Dept (DeptID, DeptName, ManagerID, Location) VALUES \
('10', 'Corporate', '299034', 'Calcutta'), \
('20', 'Sales', '239456', 'Calcutta'), \
('30', 'Accounts', '822134', 'Calcutta'), \
('40', 'Production', '349870', 'Bombay');")
r("DROP TABLE IF EXISTS Emp;")
r("CREATE TABLE IF NOT EXISTS Emp ( \
EmpID char(6)  NOT NULL, \
LastName varchar(50) , \
FirstName varchar(50) , \
JobDesc varchar(50) , \
JoinDate date NOT NULL, \
Salary int(11) , \
Comm float , \
DeptID char(2) \
) ;")
r("INSERT INTO Emp (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) \
VALUES \
('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.1, '10'), \
('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '10'), \
('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');"
)

0
0
4
0
0
12

## Emp2 and Dept2

In [68]:
r("DROP TABLE IF EXISTS Emp2;")
r("CREATE TABLE IF NOT EXISTS Emp2 ( \
  EmpID char(6)  NOT NULL, \
  LastName varchar(50) , \
  FirstName varchar(50) , \
  JobDesc varchar(50) , \
  JoinDate date NOT NULL, \
  Salary int(11) , \
  Comm float , \
  DeptID char(2) \
) ;")
r("INSERT INTO Emp2 (EmpID, LastName, FirstName, JobDesc, JoinDate, Salary, Comm, DeptID) VALUES \
	('742866', 'Bacchan', 'Amitabh', 'Executive', '2003-03-10', 50000, 0.10, '10'), \
	('349870', 'Mukherjee', 'Rani', 'Manager', '2005-05-04', 25000, 0.06, '40'), \
	('865477', 'Dikshit', 'Madhuri', 'Clerk', '2002-04-04', 10000, 0.02, '20'), \
	('239456', 'Khan', 'Shahrukh', 'Manager', '2004-01-03', 30000, 0.07, '20'), \
	('897889', 'Sehwag', 'Virender', 'Cus_Rep', '2005-01-02', 15000, 0.05, '20'), \
	('123980', 'Dhoni', 'Mahender', 'Clerk', '2004-10-09', 9000, 0.02, '40'), \
	('822134', 'Dravid', 'Rahul', 'Sr Manager', '2000-06-04', 40000, 0.08, '30'), \
	('997445', 'Dalmia', 'Jagmohan', 'Clerk', '2001-07-01', 12000, 0.02, '30'), \
	('989007', 'Ganguly', 'Sourav', 'Cus_Rep', '2002-01-01', 20000, 0.03, '40'), \
	('299034', 'Ganesan', 'Rekha', 'Director', '2002-10-10', 60000, 0.11, '10'), \
	('546223', 'Karthikeyan', 'Narayan', 'Secretary', '2005-12-04', 40000, 0.09, '50'), \
	('223112', 'Mirza', 'Sania', 'Cus_Rep', '2001-11-19', 25000, 0.04, '30');")

r("DROP TABLE IF EXISTS Dept2;")
r("CREATE TABLE Dept2 ( \
  DeptID char(2)  NOT NULL, \
  DeptName varchar(50) , \
  ManagerID char(6) , \
  Location varchar(50) \
 );")
r("INSERT INTO Dept2 (DeptID, DeptName, ManagerID, Location) VALUES \
	('10', 'Corporate', '299034', 'Calcutta'), \
	('20', 'Sales', '239456', 'Calcutta'), \
	('30', 'Accounts', '822134', 'Calcutta'), \
	('70', 'Production', '349870', 'Bombay');")

0
0
12
0
0
4

# Execution

In [86]:
# SELECT *
r('SELECT * FROM Emp LIMIT 3')

    EmpID   LastName FirstName    JobDesc    JoinDate  Salary  Comm DeptID
0  742866    Bacchan   Amitabh  Executive  2003-03-10   50000  0.10     10
1  349870  Mukherjee      Rani    Manager  2005-05-04   25000  0.06     40
2  865477    Dikshit   Madhuri      Clerk  2002-04-04   10000  0.02     20

In [38]:
# SELECT columns
r('SELECT EmpID, FirstName, LastName FROM Emp LIMIT 3')

    EmpID FirstName   LastName
0  742866   Amitabh    Bacchan
1  349870      Rani  Mukherjee
2  865477   Madhuri    Dikshit

In [116]:
# SELECT columns with OR condition
r('SELECT EmpID, FirstName, LastName,Salary, JobDesc FROM Emp WHERE Salary>=10000 OR JobDesc="Clerk"')

     EmpID FirstName     LastName  Salary     JobDesc
0   742866   Amitabh      Bacchan   50000   Executive
1   349870      Rani    Mukherjee   25000     Manager
2   865477   Madhuri      Dikshit   10000       Clerk
3   239456  Shahrukh         Khan   30000     Manager
4   897889  Virender       Sehwag   15000     Cus_Rep
5   123980  Mahender        Dhoni    9000       Clerk
6   822134     Rahul       Dravid   40000  Sr Manager
7   997445  Jagmohan       Dalmia   12000       Clerk
8   989007    Sourav      Ganguly   20000     Cus_Rep
9   299034     Rekha      Ganesan   60000    Director
10  546223   Narayan  Karthikeyan   40000   Secretary
11  223112     Sania        Mirza   25000     Cus_Rep

In [117]:
# SELECT columns with AND condition
r('SELECT EmpID, FirstName, LastName,Salary,JobDesc FROM Emp WHERE Salary>=10000 AND JobDesc="Clerk"')

    EmpID FirstName LastName  Salary JobDesc
0  865477   Madhuri  Dikshit   10000   Clerk
1  997445  Jagmohan   Dalmia   12000   Clerk

In [112]:
r('SELECT * FROM Emp')

     EmpID     LastName FirstName     JobDesc    JoinDate  Salary  Comm DeptID
0   742866      Bacchan   Amitabh   Executive  2003-03-10   50000  0.10     10
1   349870    Mukherjee      Rani     Manager  2005-05-04   25000  0.06     40
2   865477      Dikshit   Madhuri       Clerk  2002-04-04   10000  0.02     20
3   239456         Khan  Shahrukh     Manager  2004-01-03   30000  0.07     20
4   897889       Sehwag  Virender     Cus_Rep  2005-01-02   15000  0.05     20
5   123980        Dhoni  Mahender       Clerk  2004-10-09    9000  0.02     40
6   822134       Dravid     Rahul  Sr Manager  2000-06-04   40000  0.08     30
7   997445       Dalmia  Jagmohan       Clerk  2001-07-01   12000  0.02     30
8   989007      Ganguly    Sourav     Cus_Rep  2002-01-01   20000  0.03     40
9   299034      Ganesan     Rekha    Director  2002-10-10   60000  0.11     10
10  546223  Karthikeyan   Narayan   Secretary  2005-12-04   40000  0.09     10
11  223112        Mirza     Sania     Cus_Rep  2001-11-19   25000  0.04     30

In [106]:
# SELECT with JOIN
r('SELECT t1.EmpID, t1.FirstName, t1.LastName, t2.DeptName FROM Emp as t1 JOIN Dept as t2 ON t1.DeptID=t2.DeptID')

     EmpID FirstName     LastName    DeptName
0   742866   Amitabh      Bacchan   Corporate
1   349870      Rani    Mukherjee  Production
2   865477   Madhuri      Dikshit       Sales
3   239456  Shahrukh         Khan       Sales
4   897889  Virender       Sehwag       Sales
5   123980  Mahender        Dhoni  Production
6   822134     Rahul       Dravid    Accounts
7   997445  Jagmohan       Dalmia    Accounts
8   989007    Sourav      Ganguly  Production
9   299034     Rekha      Ganesan   Corporate
10  546223   Narayan  Karthikeyan   Corporate
11  223112     Sania        Mirza    Accounts

In [52]:
# DISTINCT
r('SELECT DISTINCT (JobDesc) FROM Emp')

      JobDesc
0   Executive
1     Manager
2       Clerk
3     Cus_Rep
4  Sr Manager
5    Director
6   Secretary

In [61]:
# COUNT
r('SELECT COUNT(DISTINCT JobDesc) AS Count_of_job_descriptions FROM Emp')

   Count_of_job_descriptions
0                          7

In [80]:
# Wildcards
r('SELECT FirstName, LastName from Emp where FirstName like "Ma%" OR LastName like "Gan____"')

  FirstName LastName
0   Madhuri  Dikshit
1  Mahender    Dhoni
2    Sourav  Ganguly
3     Rekha  Ganesan

In [108]:
# BETWEEN and IN
r('SELECT EmpID, FirstName FROM Emp WHERE SALARY BETWEEN 20000 AND 50000 AND DeptID IN (30,40)')

    EmpID FirstName
0  349870      Rani
1  822134     Rahul
2  989007    Sourav
3  223112     Sania

In [107]:
# ORDER
r('SELECT EmpID, FirstName, LastName from Emp ORDER BY FirstName ASC')

     EmpID FirstName     LastName
0   742866   Amitabh      Bacchan
1   997445  Jagmohan       Dalmia
2   865477   Madhuri      Dikshit
3   123980  Mahender        Dhoni
4   546223   Narayan  Karthikeyan
5   822134     Rahul       Dravid
6   349870      Rani    Mukherjee
7   299034     Rekha      Ganesan
8   223112     Sania        Mirza
9   239456  Shahrukh         Khan
10  989007    Sourav      Ganguly
11  897889  Virender       Sehwag

In [101]:
# Single row string and arithmetic operation 
r('SELECT EmpID, concat(FirstName," ",LastName) AS Name, Salary+Salary*Comm AS Total_Pay FROM Emp ORDER BY Name')

     EmpID                 Name     Total_Pay
0   742866      Amitabh Bacchan  55000.000075
1   997445      Jagmohan Dalmia  12239.999995
2   865477      Madhuri Dikshit  10199.999996
3   123980       Mahender Dhoni   9179.999996
4   546223  Narayan Karthikeyan  43600.000143
5   822134         Rahul Dravid  43199.999928
6   349870       Rani Mukherjee  26499.999966
7   299034        Rekha Ganesan  66599.999964
8   223112          Sania Mirza  25999.999978
9   239456        Shahrukh Khan  32100.000009
10  989007       Sourav Ganguly  20599.999987
11  897889      Virender Sehwag  15750.000011

# Close_connection

In [ ]:
DBConn.close()